#include <iostream>

using namespace std;

int main()
{
   int a;
   setlocale (LC_ALL, "Russian");
   cin >> a;


   if (a>=10 and a<=19) {
        if (a%100==10) {cout<<"десять";}
        if (a%100==11) {cout<<"одинадцать";}
        if (a%100==12) {cout<<"двенадцать";}
        if (a%100==13) {cout<<"тринадцать";}
        if (a%100==14) {cout<<"четырнадцать";}
        if (a%100==15) {cout<<"пятнадцать";}
        if (a%100==16) {cout<<"шестнадцать";}
        if (a%100==17) {cout<<"семнадцать";}
        if (a%100==18) {cout<<"восемнадцать";}
        if (a%100==19) {cout<<"девятнадцать";}
        return 0;
   }
   if (a>=20 and a<=90) {
    if (a / 10 == 2) {cout<<"двадцать";}
    if (a / 10 == 3) {cout<<"тридцать";}
    if (a / 10 == 4) {cout<<"сорок";}
    if (a / 10 == 5) {cout<<"пятьдесят";}
    if (a / 10 == 6) {cout<<"шестьдесят";}
    if (a / 10 == 7) {cout<<"семьдесят";}
    if (a / 10 == 8) {cout<<"восемьдесят";}
    if (a / 10 == 9) {cout<<"девяносто";}
   }

   if (a % 10 >= 1 and a % 10 <= 9) {
    if (a % 10 == 1) { cout << " один"; }
    if (a % 10 == 2) { cout << " два";}
    if (a % 10 == 3) { cout << " три";}
    if (a % 10 == 4) { cout <<"четыре";}
    if (a % 10 == 5) { cout <<"пять";}
    if (a % 10 == 6) { cout <<"шесть";}
    if (a % 10 == 7) { cout <<"семь";}
    if (a % 10 == 8) { cout << "восемь" ;}
    if (a % 10 == 9) { cout << "девять" ;}
   }












    return 0;
}
